### 1. Series

In [117]:
import pandas as pd

-Series 생성
    - numpy 1차원 어레이 +index

In [113]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index = ["서울","부산","인천","대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [114]:
type(s)

pandas.core.series.Series

NameError: name 'np' is not defined

In [ ]:
s.index, type(s.index)

(Index(['서울', '부산', '인천', '대구'], dtype='object'),
 pandas.core.indexes.base.Index)

In [ ]:
s.values, type(s.values)

(array([9904312, 3448737, 2890451, 2466052], dtype=int64), numpy.ndarray)

In [ ]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

연산(Operation)

In [ ]:
s / 10000000

도시
서울    0.990431
부산    0.344874
인천    0.289045
대구    0.246605
Name: 인구, dtype: float64

In [ ]:
s['대구'],s[3],s[-1]

(2466052, 2466052, 2466052)

In [ ]:
s[['서울','부산']]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [ ]:
s[(s > 2500000) & (s < 5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- 슬라이싱

In [ ]:
# 숫자 인덱스로 하는 슬라이싱은 넘파이와 동일함
s[:2]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [ ]:
# 인덱스로 할경우에는 :뒤 인덱스를 포함함
s['서울':'인천']

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- series and dictionary

In [ ]:
'서울' in s

True

In [ ]:
for k, v in s.items():
    print(f'{k}:{v}')

서울:9904312
부산:3448737
인천:2890451
대구:2466052

In [ ]:
d= {"서울": 9631482,"부산": 3393191,"인천": 2632035,"대전": 1490158}
s2 = pd.Series(d)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [ ]:
# 순서를 정하고 싶으면, 인덱스를 별도로 설정해야 함
s2 = pd.Series(d, index=['서울','부산','인천','대전'])
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

- 인덱스 기반 연산

In [ ]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [ ]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

- 데이터의 갱신, 추가, 삭제

In [ ]:
rs['부산'] = 1.64
rs[1] = 2.83
rs.인천 = 9.82
rs

부산    1.64
서울    2.83
인천    9.82
dtype: float64

In [ ]:
del rs['인천']
rs

부산    1.64
서울    2.83
dtype: float64

In [ ]:
rs['광주'] = 1.51
rs

부산    1.64
서울    2.83
광주    1.51
dtype: float64

In [ ]:
sc = pd.Series([80,60,90,70],
              index = ["국어","영어","수학","과학"])
sc2 = pd.Series([90,70,50,100],
              index = ["국어","영어","수학","한국사"])
sc,  sc2

(국어    80
 영어    60
 수학    90
 과학    70
 dtype: int64,
 국어      90
 영어      70
 수학      50
 한국사    100
 dtype: int64)

In [ ]:
sc+sc2

과학       NaN
국어     170.0
수학     140.0
영어     130.0
한국사      NaN
dtype: float64

In [ ]:
sc-sc2

과학      NaN
국어    -10.0
수학     40.0
영어    -10.0
한국사     NaN
dtype: float64

In [ ]:
sc*sc2

과학        NaN
국어     7200.0
수학     4500.0
영어     4200.0
한국사       NaN
dtype: float64

In [ ]:
sc/sc2

과학          NaN
국어     0.888889
수학     1.800000
영어     0.857143
한국사         NaN
dtype: float64

dice =np.array([4,2,6,1,5,3])

In [123]:
import numpy as np
dice = np.random.randint(1,7,100)
np.unique(dices)

array([1, 2, 3, 4, 5, 6])

In [124]:
# 요약기술통계
dice.describe()

AttributeError: 'numpy.ndarray' object has no attribute 'describe'

In [125]:
s.sort_index()

대구    2466052
부산    3448737
서울    9904312
인천    2890451
dtype: int64

In [127]:
s.sort_index(ascending = False)

인천    2890451
서울    9904312
부산    3448737
대구    2466052
dtype: int64

In [128]:
s.sort_index(inplace=True)

In [129]:
s

대구    2466052
부산    3448737
서울    9904312
인천    2890451
dtype: int64

- 결측치

In [130]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [131]:
ds.isna()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [132]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [134]:
ds.isna().sum()

2

In [135]:
import seaborn as sns

In [138]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [139]:
survived = titanic['survived']
age = titanic['age']

In [140]:
survived.isna().sum()

0

In [143]:
age.isna().sum()

177

In [145]:
age.count()

714

In [147]:
# 결측치를 제거
ds.dropna(inplace=True)

In [148]:
ds

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [149]:
ds = s - s2

In [152]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [153]:
# 결측치를 중앙값으로 대체
ds.fillna(ds.median())

대구    258416.0
대전    258416.0
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [154]:
# 결측치를 평균으로 대체하고  ds를 변경
ds.fillna(ds.mean(), inplace =True)

In [155]:
ds

대구    195597.333333
대전    195597.333333
부산     55546.000000
서울    272830.000000
인천    258416.000000
dtype: float64

In [159]:
# 결측치를 0으로 설정하고, 데이터 타입을 정수형으로 변경
ds = s - s2
ds.fillna(0).astype(int)

대구         0
대전         0
부산     55546
서울    272830
인천    258416
dtype: int32